app/Controllers/CustomerController.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $session = session();
        $role =  $session->get('user');
        /*print_r($session->get('user'));
        die;*/
        if (!isset($role)) {
             return redirect()->to('/login');
        }
        $model = new CustomerModel();
        $data['customers'] = $model->findAll();

INSERT INTO `customers` (`name`, `email`, `phone`, `address`) VALUES ('Customer 2', 'customer2@gmail.com', '546456546', 'test')
---
    public function store()
    {
        $model = new CustomerModel();
        $data = $this->request->getPost();
        $model->save($data);