app/Controllers/DashboardController.php

    public function index()
    {
        $leadModel = new LeadModel();
        $data = [
            'leads_per_status' => $leadModel->select('status, COUNT(*) as count')->groupBy('status')->findAll(),
            // Add other statistics as needed
        ];
---
SELECT `status`, COUNT(*) as count
FROM `leads`
GROUP BY `status`