app/Controllers/LeadController.php

SELECT *
FROM `leads`
---
        }*/


        $data['leads'] = $model->findAll();

INSERT INTO `leads` (`customer_id`, `status`, `description`) VALUES ('3', 'Contacted', 'testtest')
---
    public function store()
    {
        $model = new LeadModel();
        $data = $this->request->getPost();
        $model->save($data);