app/Controllers/LeadController.php

SELECT *
FROM `leads`
---
    public function index()
    {
       $session = session();
        $role =  $session->get('user');
        /*print_r($session->get('user'));
        die;*/
        if (!isset($role)) {
             return redirect()->to('/login');
        }
        $model = new LeadModel();
        $data['leads'] = $model->findAll();

SELECT *
FROM `customers`
---
    public function create()
    {
        $session = session();
        $role =  $session->get('user');
        /*print_r($session->get('user'));
        die;*/
        if (!isset($role)) {
             return redirect()->to('/login');
        }
        $customerModel = new CustomerModel();
        $data['customers'] = $customerModel->findAll();

INSERT INTO `leads` (`customer_id`, `status`, `description`) VALUES ('1', 'Contacted', 'testt')
---
    public function store()
    {
        $model = new LeadModel();
        $data = $this->request->getPost();
        $model->save($data);

SELECT *
FROM `leads`
WHERE `leads`.`id` = '1'
SELECT *
FROM `customers`
---
    public function edit($id)
    {
        $model = new LeadModel();
        $data['lead'] = $model->find($id);
        $customerModel = new CustomerModel();
        $data['customers'] = $customerModel->findAll();

DELETE FROM `leads`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $model = new LeadModel();
        $model->delete($id);