app/Controllers/LeadController.php

UPDATE `leads` SET `customer_id` = '1', `status` = 'Qualified', `description` = 'contacted'
WHERE `leads`.`id` IN ('1')
---
    public function filter($status)
    {
        $model = new LeadModel();
        $data['leads'] = $model->where('status', $status)->findAll();
        return view('leads/index', $data);
    }
    /*public function store()
    {
        $model = new LeadModel();
        $data = $this->request->getPost();
        $model->save($data);